# Homebrew Bundle file for managing packages
# Install with: brew bundle

# Note: homebrew/bundle tap is no longer needed (merged into core)

# Core development tools
brew "git"
brew "gh"
brew "asdf"
brew "curl"
brew "git-lfs"
brew "gnupg"

# 1Password CLI for shell plugins and secure authentication
cask "1password-cli"

# Additional useful development tools
brew "wget"
brew "jq"
brew "tree"
brew "htop"
brew "diff-so-fancy"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"  # Modern replacement for ls (successor to exa)

# Optional: Uncomment based on your needs
brew "docker"
# brew "postgresql"
brew "redis"
# brew "nginx"

# Casks (GUI applications)
# cask "visual-studio-code"
# cask "1password"
# cask "docker" 